DEEJmeters.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="GET Survey" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">2000</stringProp>
        <stringProp name="ThreadGroup.ramp_time">100</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <stringProp name="ThreadGroup.duration">100</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET Survey" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="access_token" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">eyJhbGciOiJSUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VyX25hbWUiOiJ0cmlldG5ndXllbiIsInNjb3BlIjpbIm9wZW5pZCJdLCJleHAiOjE2NjAwNzQ2OTEsImlhdCI6MTY2MDA3NDM5MSwiYXV0aG9yaXRpZXMiOlsiRVNVUlZFWV9VU0VSIiwiUk9MRV9BRE1JTiIsIlJPTEVfVVNFUiIsIkVIT01FX0FETUlOIiwiRVNVUlZFWV9BRE1JTiJdLCJqdGkiOiJWSzlndmItN1VrOVJBS05rc29uSUphUG1iMUUiLCJjbGllbnRfaWQiOiJlLWhvbWUifQ.hG6AAKHV9WqluG-c-5KJUmUVsdWr7DUvu7Ybjf6m90DXnv7cxNkbPShXyDBU5IRgbpGgmmd5dtQuLM7kAEmiRnTAWxB6vt4LUPFfVNvJSU-XO9RrxmK-YLS_ObYcI2FOaKos0cK2ZOfdz1B-VP8ntz7Fev877ygRFW9WKzMdyZaMA8fo06ZEVP-DtKZZkMsdCt0zl0y556WLgDwjWMXDGOPCm1MPdNnxIa6HZNWkSwr-lSldsVSs2FwYyBplyOuJIA8WA_850xg2405M-XmSqjSsE7yyOOnhvHaDX_y7mwckQ_t5q7xOAlThvhYwaAVYk_yYSYsjsgkbQcJBn7hTFw</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                <stringProp name="Argument.name">access_token</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">boschdex.com</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">services/esurvey/api/surveys?category=SURVEY&amp;page=0</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
          <collectionProp name="Asserion.test_strings">
            <stringProp name="3373707">name</stringProp>
          </collectionProp>
          <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
          <boolProp name="Assertion.assume_success">false</boolProp>
          <intProp name="Assertion.test_type">16</intProp>
        </ResponseAssertion>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="GET Survey" enabled="false">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">2000</stringProp>
        <stringProp name="ThreadGroup.ramp_time">100</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET Survey" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="access_token" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">eyJhbGciOiJSUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VyX25hbWUiOiJ0cmlldG5ndXllbiIsInNjb3BlIjpbIm9wZW5pZCJdLCJleHAiOjE2NjAwNzIyMzksImlhdCI6MTY2MDA3MTkzOSwiYXV0aG9yaXRpZXMiOlsiRVNVUlZFWV9VU0VSIiwiUk9MRV9BRE1JTiIsIlJPTEVfVVNFUiIsIkVIT01FX0FETUlOIiwiRVNVUlZFWV9BRE1JTiJdLCJqdGkiOiJXT3luWm12amo3dWswODhGSVZsREx0VTZnTWciLCJjbGllbnRfaWQiOiJlLWhvbWUifQ.l6mhf-9tF2LjC22sBE155oBBLI6prUgy7VjLxym1mXz94oxxytrdesNs9XEkjNK8EIcucpw9q4mjkhxfdnIMNuICZqWlsJ3tKBR24Gd5L1Jq6KKP1PaGgXAGah6OBkUnP4SNMZKb841EtrkkvhzYd4IyWHcwtRVeBJd3sXuXQFLSIuSVN8ktPJdcLnPWD2J5L5eeqy5sYOeFsScRTu3V7NaHYuq4H9n4Z6wz-cDHSYEzY3EHsu5xnrc4Fyc4tGYQxxavnxju_HOyGjLDN1M-0taS6URgN3JjcX6S0VW5zMI49Qpc2sXHhfdTo94qxMRTfOoTFjqM-856A9X6WIa8kA</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                <stringProp name="Argument.name">access_token</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">boschdex.com</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">services/esurvey/api/surveys?category=SURVEY&amp;page=0</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <boolProp name="HTTPSampler.md5">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
          <collectionProp name="Asserion.test_strings">
            <stringProp name="3373707">name</stringProp>
          </collectionProp>
          <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
          <boolProp name="Assertion.assume_success">false</boolProp>
          <intProp name="Assertion.test_type">16</intProp>
        </ResponseAssertion>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="POST Submit Survey" enabled="false">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1000</stringProp>
        <stringProp name="ThreadGroup.ramp_time">500</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <stringProp name="ThreadGroup.duration">500</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Submit Survey" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
 &quot;surveyId&quot;: 582,&#xd;
 &quot;answers&quot;: [&#xd;
  {&#xd;
   &quot;questionId&quot;: 3515,&#xd;
   &quot;answerId&quot;: 11631&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3516,&#xd;
   &quot;answerId&quot;: 11633&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3517,&#xd;
   &quot;answerId&quot;: 11635&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3518,&#xd;
   &quot;answerId&quot;: 11636&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3519,&#xd;
   &quot;answerId&quot;: 11638&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3520,&#xd;
   &quot;answerId&quot;: 11640&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3521,&#xd;
   &quot;answerId&quot;: 11643&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3522,&#xd;
   &quot;answerId&quot;: 11644&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3523,&#xd;
   &quot;answerId&quot;: 11646&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3524,&#xd;
   &quot;answerId&quot;: 11649&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3525,&#xd;
   &quot;answerId&quot;: 11650&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3526,&#xd;
   &quot;answerId&quot;: 11653&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3527,&#xd;
   &quot;answerId&quot;: 11654&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3528,&#xd;
   &quot;answerId&quot;: 11656&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3529,&#xd;
   &quot;answerId&quot;: 11659&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3530,&#xd;
   &quot;answerId&quot;: 11660&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3531,&#xd;
   &quot;answerId&quot;: 11662&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3532,&#xd;
   &quot;answerId&quot;: 11665&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3533,&#xd;
   &quot;answerId&quot;: 11666&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3534,&#xd;
   &quot;answerId&quot;: 11668&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3535,&#xd;
   &quot;answerId&quot;: 11670&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3536,&#xd;
   &quot;answerId&quot;: 11673&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3537,&#xd;
   &quot;answerId&quot;: 11674&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3538,&#xd;
   &quot;answerId&quot;: 11677&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3539,&#xd;
   &quot;answerId&quot;: 11678&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3540,&#xd;
   &quot;answerId&quot;: 11680&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3541,&#xd;
   &quot;answerId&quot;: 11682&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3542,&#xd;
   &quot;answerId&quot;: 11685&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3543,&#xd;
   &quot;answerId&quot;: 11687&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3544,&#xd;
   &quot;answerId&quot;: 11688&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3545,&#xd;
   &quot;answerId&quot;: 11690&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3546,&#xd;
   &quot;answerId&quot;: 11693&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3547,&#xd;
   &quot;answerId&quot;: 11694&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3548,&#xd;
   &quot;answerId&quot;: 11696&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3549,&#xd;
   &quot;answerId&quot;: 11698&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3550,&#xd;
   &quot;answerId&quot;: 11701&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3551,&#xd;
   &quot;answerId&quot;: 11702&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3552,&#xd;
   &quot;answerId&quot;: 11704&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3553,&#xd;
   &quot;answerId&quot;: 11706&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3554,&#xd;
   &quot;answerId&quot;: 11709&#xd;
  },&#xd;
  {&#xd;
   &quot;questionId&quot;: 3555,&#xd;
   &quot;answerId&quot;: 11711&#xd;
  }&#xd;
 ]&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">boschdex.com</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">services/esurvey/api/public/user-answers/batch</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.connect_timeout">60000</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">content-type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
          <collectionProp name="Asserion.test_strings">
            <stringProp name="958960780">answerDate</stringProp>
          </collectionProp>
          <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
          <boolProp name="Assertion.assume_success">false</boolProp>
          <intProp name="Assertion.test_type">16</intProp>
        </ResponseAssertion>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="false">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>